In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import re

In [2]:
df = pd.read_csv('train.csv')
df.head()

,id,keyword,location,text,target
0,1,NaN,NaN,Our Deeds are the Reason of this #earthquake M...,1
1,4,NaN,NaN,Forest fire near La Ronge Sask. Canada,1
2,5,NaN,NaN,All residents asked to 'shelter in place' are ...,1
3,6,NaN,NaN,"13,000 people receive #wildfires evacuation or...",1
4,7,NaN,NaN,Just got sent this photo from Ruby #Alaska as ...,1

In [3]:
df.isnull().sum()

id             0
keyword       61
location    2533
text           0
target         0
dtype: int64

In [4]:
df['keyword'].value_counts()

fatalities               45
armageddon               42
deluge                   42
harm                     41
damage                   41
                         ..
forest%20fire            19
epicentre                12
threat                   11
inundation               10
radiation%20emergency     9
Name: keyword, Length: 221, dtype: int64

In [5]:
test = pd.read_csv('test.csv')
test.head() #preview

   id keyword location                                               text
0   0     NaN      NaN                 Just happened a terrible car crash
1   2     NaN      NaN  Heard about #earthquake is different cities, s...
2   3     NaN      NaN  there is a forest fire at spot pond, geese are...
3   9     NaN      NaN           Apocalypse lighting. #Spokane #wildfires
4  11     NaN      NaN      Typhoon Soudelor kills 28 in China and Taiwan

In [6]:
test['keyword'].value_counts()

deluged                  23
demolished               22
rubble                   22
first%20responders       21
annihilation             21
                         ..
forest%20fire             5
threat                    5
radiation%20emergency     5
inundation                4
epicentre                 1
Name: keyword, Length: 221, dtype: int64

In [7]:
df['keyword'].str.replace('%20', '').value_counts() #preview

fatalities            45
armageddon            42
deluge                42
damage                41
bodybags              41
                      ..
forestfire            19
epicentre             12
threat                11
inundation            10
radiationemergency     9
Name: keyword, Length: 221, dtype: int64

In [8]:
df['keyword'] = df['keyword'].str.replace('%20', '') #make permanent

In [9]:
df['keyword'].value_counts()

fatalities            45
armageddon            42
deluge                42
damage                41
bodybags              41
                      ..
forestfire            19
epicentre             12
threat                11
inundation            10
radiationemergency     9
Name: keyword, Length: 221, dtype: int64

In [35]:
df['location'].sample(5)

7194                Des Moines, IA
3137    Columbus ?? North Carolina
1876                     w. Nykae
2923         R'lyeh, South Pacific
3135               New Orleans, LA
Name: location, dtype: object

In [13]:
#d[df['text'].str.contains('#')]
df['text'].str.contains('#').value_counts(normalize=True)

False    0.768685
True     0.231315
Name: text, dtype: float64

This means that of text containing the hashtag symbol, nearly 77% of them were "0" or not our target

I'd like to replace the symbol (which is likely filtered out during vectorization) with the word

In [36]:
df.fillna('', inplace=True)

In [37]:
df.isnull().sum()

id          0
keyword     0
location    0
text        0
target      0
dtype: int64

In [38]:
df.columns

Index(['id', 'keyword', 'location', 'text', 'target'], dtype='object')

In [39]:
df['all_text'] = df['keyword'] + ' ' + df['location'] + ' ' + df['text']

In [40]:
df.head()

,id,keyword,location,text,target,all_text
0,1,,,Our Deeds are the Reason of this #earthquake M...,1,Our Deeds are the Reason of this #earthquake...
1,4,,,Forest fire near La Ronge Sask. Canada,1,Forest fire near La Ronge Sask. Canada
2,5,,,All residents asked to 'shelter in place' are ...,1,All residents asked to 'shelter in place' ar...
3,6,,,"13,000 people receive #wildfires evacuation or...",1,"13,000 people receive #wildfires evacuation ..."
4,7,,,Just got sent this photo from Ruby #Alaska as ...,1,Just got sent this photo from Ruby #Alaska a...

In [41]:
df.sample(5)

,id,keyword,location,text,target,all_text
2837,4081,displaced,UK & Germany,#Myanmar Displaced #Rohingya at #Sittwe point...,1,displaced UK & Germany #Myanmar Displaced #R...
3093,4440,electrocute,CA,Photo: weallheartonedirection: I wouldnÛªt le...,0,electrocute CA Photo: weallheartonedirection: ...
33,50,ablaze,AFRICA,#AFRICANBAZE: Breaking news:Nigeria flag set a...,1,ablaze AFRICA #AFRICANBAZE: Breaking news:Nige...
7493,10720,wreck,"Gwersyllt, Wales",Don't think I Can take anymore emotional wreck...,0,"wreck Gwersyllt, Wales Don't think I Can take ..."
5198,7421,obliterated,The Wood,God the @mets are so cocky right now and I lov...,0,obliterated The Wood God the @mets are so cock...

In [42]:
df.to_csv('training_clean_2.csv', index=False)